# -*- coding: utf-8 -*-
"""
Задание 9.3a

Сделать копию функции get_int_vlan_map из задания 9.3.

Дополнить функцию: добавить поддержку конфигурации, когда настройка access-порта
выглядит так:
    interface FastEthernet0/20
        switchport mode access
        duplex auto

То есть, порт находится в VLAN 1

В таком случае, в словарь портов должна добавляться информация, что порт в VLAN 1
Пример словаря:
    {'FastEthernet0/12': 10,
     'FastEthernet0/14': 11,
     'FastEthernet0/20': 1 }

У функции должен быть один параметр config_filename, который ожидает
как аргумент имя конфигурационного файла.

Проверить работу функции на примере файла config_sw2.txt

Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

def get_int_vlan_map(config_filename):
    with open(config_filename) as file:
        port_trunk = {}
        port_access = {}

        for line in file:
            if line.count("interface"):
                _, intf = line.split()
                vlan = None
            elif line.count("vlan"):
                _, mode, *other, vlan = line.split()
                if mode == "access":
                    port_access[intf] = int(vlan)
                elif mode == "trunk":
                    vlans = (vlan.split(","))
                    port_trunk[intf] = [int(vlan) for vlan in vlans]
            elif line.count("duplex auto") and not vlan:
                port_access[intf] = 1

    return (port_access, port_trunk)

result = get_int_vlan_map("config_sw2.txt")

print(result)